---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Roughness
source: html/0f268175-02d1-3bed-cc5b-b8b6db7cb480.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Roughness Property

The roughness value of the construction.

## Syntax (C#)
```csharp
public int Roughness { get; }
```